
var typeA, typeB;
function onStart(id) {
    $('#section-1').addClass('hidden');
    $('#section-2').removeClass('hidden');
    $('#section-3').addClass('hidden');
    $('#section-4').addClass('hidden');
    $('#section-5').addClass('hidden');
    gtag('click',{id});
}
function backToStart() {
    $('#section-1').removeClass('hidden');
    $('#section-2').addClass('hidden');
    $('#section-3').addClass('hidden');
    $('#section-4').addClass('hidden');
    $('#section-5').addClass('hidden');
}
function step2() {
    $('#section-1').addClass('hidden');
    $('#section-2').addClass('hidden');
    $('#section-3').removeClass('hidden');
    $('#section-4').addClass('hidden');
    $('#section-5').addClass('hidden');
}
function generatePage() {
    $('#section-1').addClass('hidden');
    $('#section-2').addClass('hidden');
    $('#section-3').addClass('hidden');
    $('#section-4').removeClass('hidden')
    $('#section-5').addClass('hidden');
    $('.select-menu').removeClass('selected');
    $('#goStep2').prop("disabled", true);
    $('#goStep2_m').prop("disabled", true);
    $('#goGeneratePage').prop("disabled", true);
    $('#goGeneratePage_m').prop("disabled", true);
    setHTML();
}
function downloadPage() {
    $('#section-1').addClass('hidden');
    $('#section-2').addClass('hidden');
    $('#section-3').addClass('hidden');
    $('#section-4').addClass('hidden');
    $('#section-5').removeClass('hidden');
    $('#section-5 .overflow-y-scroll').scrollTop(0);
}
function selectFirstRawMats(e) {
    typeA = e;
    $('#section-2 .select-menu').removeClass('selected');
    $('.' + typeA).addClass('selected');
    $('.selected-menu').addClass('hidden');
    $('.selected-menu.' + typeA).toggleClass('hidden');
    $('#goStep2').prop("disabled", false);
    $('#goStep2_m').prop("disabled", false);
    $('#goStep2').addClass('selected');
    $('#goStep2_m').addClass('selected');
}
function selectTaste(e) {
    typeB = e;
    $('#section-3 .select-menu').removeClass('selected');
    $('.' + typeB).addClass('selected');
    $('.selected-menu2').addClass('hidden');
    $('.selected-menu2.' + typeB).toggleClass('hidden');
    $('#goGeneratePage').prop("disabled", false);
    $('#goGeneratePage_m').prop("disabled", false);
    $('#goGeneratePage').addClass('selected');
    $('#goGeneratePage_m').addClass('selected');
}
function toBottom() {
    $('#section-5 .overflow-y-scroll').animate({ scrollTop: $('#section-5 .overflow-y-scroll').height() }, 1000);
}
function toTop() {
    $('#section-5 .overflow-y-scroll').animate({ scrollTop: 0 }, 1000);
}

$('#section-5 .overflow-y-scroll').scroll(function () {
    if ($('#section-5 .overflow-y-scroll').scrollTop() > $('#section-5 .overflow-y-scroll').height() - 100) {
        $('#scrolldown').addClass('hidden');
        $('#scrollup').removeClass('hidden');
    } else {
        $('#scrolldown').removeClass('hidden');
        $('#scrollup').addClass('hidden');
    }
});

function setHTML() {
    var datasets = $.map(d, function (val, i) {
        if (val.typeA == typeA && val.typeB == typeB) {
            return val.data;
        }
    });

    var dataset = $.map(datasets, function (val, i) {
        if (!val.selected) {
            return val;
        }
    });

    if (dataset.length == 0) {
        dataset = $.map(datasets, function (val, i) {
            val.selected = false;
            if (!val.selected) {
                return val;
            }
        });
    }

    let x = Math.floor(Math.random() * (dataset.length));

    $('#id').html('');
    $('#name').html('');
    $('#mats').html('');
    $('#spicy-level').html('');
    $('#how2-1').html('');
    $('#how2-2').html('');
    $('#how2-3').html('');
    $('#how2-4').html('');
    $('#id_m').html('');
    $('#name_m').html('');
    $('#mats_m').html('');
    $('#spicy-level_m').html('');
    $('#how2-1_m').html('');
    $('#how2-2_m').html('');
    $('#how2-3_m').html('');
    $('#how2-4_m').html('');

    $('#id').html(dataset[x].id);
    $('#name').html(dataset[x].name);
    $('#dish-img').attr('src', '/dist/image/generate/' + dataset[x].id + '.png');
    $('#download-link').attr('href', '/dist/image/download/Roza x AI quiz plate_' + dataset[x].id + '.3.png');
    $('#id_m').html(dataset[x].id);
    $('#name_m').html(dataset[x].name);
    $('#dish-img_m').attr('src', '/dist/image/generate/' + dataset[x].id + '.png');
    $('#download-link_m').attr('href', '/dist/image/download/Roza x AI quiz plate_' + dataset[x].id + '.3.png');

    for (let index = 1; index <= dataset[x].spicy; index++) {
        $('#spicy-level').append('<img src="/dist/image/icon/chili.png" alt="" class=" w-[25px] h-[25px]">')
        $('#spicy-level_m').append('<img src="/dist/image/icon/chili.png" alt="" class=" w-[25px] h-[25px]">')
    }
    dataset[x].description1.forEach(element => {
        $('#mats').append(element + '<br/>')
        $('#mats_m').append(element + '<br/>')
    });
    dataset[x].description2[1].forEach(element => {
        $('#how2-1').append(element + '<br/>')
        $('#how2-1_m').append(element + '<br/>')
    });
    dataset[x].description2[2].forEach(element => {
        $('#how2-2').append(element + '<br/>')
        $('#how2-2_m').append(element + '<br/>')
    });
    dataset[x].description2[3].forEach(element => {
        $('#how2-3').append(element + '<br/>')
        $('#how2-3_m').append(element + '<br/>')
    });
    dataset[x].description2[4].forEach(element => {
        $('#how2-4').append(element + '<br/>')
        $('#how2-4_m').append(element + '<br/>')
    });

    var setdata = $.map(d, function (val, i) {
        if (val.typeA == typeA && val.typeB == typeB) {
            for (let index = 0; index < val.data.length; index++) {
                const element = val.data[index];
                if (element.id == dataset[x].id) {
                    val.data[index].selected = true;
                }
            }
        }
        return val;
    });
    d = setdata;
    console.log(d);
    // localStorage.setItem('data', JSON.stringify(setdata));
}
var dataDefault = [
    {
        typeA: 'poke',
        typeB: 'spicy',
        data: [
            {
                id: "006",
                name: ":: ผัดเส้นสปาเกตตี้พริกแห้งเบคอน ::",
                spicy: 1,
                selected: false,
                description1:
                    [
                        'เส้นสปาเกตตี้ 120 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        'เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'กระเทียมสับ 1 ช้อนชา',
                        'หอมใหญ่สับ 1 ช้อนโต๊ะ',
                        'เบคอน 40 กรัม ',
                        'พริกแห้ง 3 เม็ด(ตัดเป็นชิ้นเล็ก)',
                        'น้ำมันพืช 1 ช้อนโต๊ะ'
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมัน กระเทียม หอมหัวใหญ่', 'พริกแห้ง เบคอน ลงไปผัดจนหอม'],
                    2: ['ใส่เส้นที่ลวกไว้แล้วลงไปผัดให้เข้ากัน'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', 'เชฟแอทโฮม ผัดให้เข้ากัน'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']

                }
            }, {
                id: "007",
                name: ":: กะเพราหมูสับพริกแห้ง ::",
                spicy: 2,
                selected: false,
                description1:
                    [
                        'หมูสับ 100 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า ',
                        'เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'กระเทียมสับ 1 ช้อนชา',
                        'พริกแห้งสับละเอียด 1 ช้อนชา',
                        'ใบกะเพรา 1 / 2 ถ้วย(10กรัม)',
                        'น้ำมันพืช 1 ช้อนโต๊ะ'
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมันลงไป ตามด้วยกระเทียม', 'หมูสับจนเหลืองหอม'],
                    2: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', 'เชฟแอทโฮม ตามด้วยพริกป่น ผัดให้เข้ากัน'],
                    3: ['ใส่ใบกะเพราและพริกสไลด์ลงไปผัดให้เข้ากัน'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้']
                }
            },
            {
                id: "009",
                name: ":: สันคอหมูคั่วพริกเกลือ ::",
                spicy: 2,
                selected: false,
                description1:
                    [
                        'สันคอหมูสไลด์ 100 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า ',
                        'เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'กระเทียมเจียว 2 ช้อนโต๊ะ',
                        'พริกสับละเอียด 1 ช้อนชา',
                        'ใบมะกรูดฉีก 3 ใบ',
                        'น้ำมัน 1 ช้อนโต๊ะ '
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมันพืชลงไปตามด้วย', 'สันคอหมูผัดจนเหลืองเกรียม'],
                    2: ['ตามด้วย กระเทียมเจียว พริกสับละเอียด ',
                        ' ใบมะกรูด ลงไปผัดจนหอม'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        'เชฟแอทโฮม ผัดให้เข้ากัน'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
                }
            },
        ]
    }, {
        typeA: 'poke',
        typeB: 'mellow',
        data: [
            {
                id: "014",
                name: ":: ผัดคะน้าหมูนุ่ม ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        'ยอดคะน้า 60 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า ',
                        'เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'สันคอหมู 40 กรัม(หั่นเป็นชิ้นเล็ก)',
                        'กระเทียมสับละเอียด 1 ช้อนโต๊ะ',
                        'พริกแดงสไลด์ 2 เม็ด',
                        'น้ำมันพืช 1 ช้อนโต๊ะ',
                        'น้ำเปล่า 4 ช้อนโต๊ะ',
                        'พริกไทยเล็กน้อย'
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมันลงไปตามด้วย ',
                        'กระเทียมสับ เนื้อหมู ผัดให้สุกเล็กน้อย'],
                    2: ['ตามด้วยผักคะน้า พริกแดง ใส่ลงไปผัดให้เข้ากัน',
                        'ในระหว่างผัดเติมน้ำเปล่าลงไปผัดด้วย'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        ' เชฟแอทโฮม และ พริกไทย ผัดให้เข้ากัน'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้']
                }
            }, {
                id: "016",
                name: ":: ข้าวผัดเบคอนกระเทียม ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        ' ข้าวสวย 100 กรัม',
                        ' ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        ' เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'เบคอน 40 กรัม',
                        '  กระเทียมสับละเอียด 1 ช้อนชา',
                        'ผักรวม 2 ช้อนโต๊ะ (20กรัม)',
                        'ไข่ไก่ 1 ฟอง ',
                        ' น้ำมัน 1 ช้อนโต๊ะ '
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมันลงไป ตามด้วยกระเทียม ',
                        ' เบคอน ผัดให้เข้ากัน'],
                    2: ['จากนั้นใส่ไข่ไก่ ผัดให้สุกเล็กน้อยตามด้วย ',
                        'ข้าวและผักรวมผัดให้เข้ากันอีกครั้ง'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        ' เชฟแอทโฮม ผัดจนหอม'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้']
                }
            },
        ]
    }, {
        typeA: 'poke',
        typeB: 'flavor',
        data: [
            {
                id: "020",
                name: ":: หมูสับผัดไข่คั่ว ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        'หมูสับ 100 กรัม',
                        'ไข่ไก่ 1 ฟอง',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า ',
                        'เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'กระเทียมสับละเอียด 1 ช้อนโต๊ะ',
                        'กระเทียมเจียว 1 ช้อนโต๊ะ',
                        'น้ำมันพืช 1  ช้อนโต๊ะ',
                        'พริกไทยเล็กน้อย',
                        'ต้นหอมซอยเล็กน้อย'

                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลาง ใส่น้ำมัน ตามด้วย',
                        'กระเทียมสับ หมูสับ ผัดจนเหลืองหอม'],
                    2: ['จากนั้นใส่ไข่ไก่ลงไปคั่วจนหอม'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        'เชฟแอทโฮม และ พริกไทย ผัดให้เข้ากันโรยด้วยต้นหอมซอย'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
                }
            }]
    }, {
        typeA: 'chicken',
        typeB: 'spicy',
        data: [
            {
                id: "010",
                name: ":: ไก่ผัดตะไคร้ ::",
                spicy: 1,
                selected: false,
                description1:
                    [
                        'สะโพกไก่หั่นชิ้น 100 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'ตะไคร้ซอย 1 ช้อนโต๊ะ ',
                        'ใบมะกรูดเด็ด 3 ใบ',
                        'กระเทียมสับละเอียด 1 ช้อนชา',
                        'พริกแห้งสับละเอียด 1 ช้อนชา',
                        'น้ำมันพืช 1 ช้อนโต๊ะ '
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมันลงไปพอร้อนใส่เนื้อไก่', 'ลงไปคั่วจนเหลือง'],
                    2: ['นำตะไคร้ ใบมะกรูด กระเทียม พริกแห้ง ', 'ลงไปผัดให้เข้ากันจนหอม'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        'เชฟแอทโฮม ผัดให้เข้าจนหอม'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
                }
            },
        ]
    }, {
        typeA: 'chicken',
        typeB: 'mellow',
        data: [
            {
                id: "018",
                name: ":: ไก่ผัดขิง ::",
                spicy: 0,
                selected: false,
                description1:
                    ['เนื้อสันในไก่สไลด์ 60 กรัม', 'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 ช้อนโต๊ะ', 'หอมใหญ่ซอย 20 กรัม ', 'ขิงซอย 15 กรัม', 'ต้นหอมท่อน 10 กรัม', 'กระเทียมสับ 1 ช้อนชา', 'พริกแดงสไลด์ 1 เม็ด', 'น้ำมันพืช 1 ช้อนโต๊ะ', 'น้ำเปล่า 3 ช้อนโต๊ะ '],
                description2: {
                    1: ['ตั้งกระทะไฟกลาง ใส่น้ำมัน ตามด้วย',
                        'กระเทียม เนื้อไก่ ผัดให้สุกเล็กน้อย'],
                    2: ['จากนั้นใส่ ขิง หอมใหญ่ พริกแดง เห็ดหอม',
                        'ต้นหอม ผัดให้เข้ากัน'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        ' เชฟแอทโฮม และ พริกไทย ผัดให้เข้ากัน'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
                }
            },
        ]
    }, {
        typeA: 'chicken',
        typeB: 'flavor',
        data: [
            {
                id: "011",
                name: ":: เส้นใหญ่คั่วไก่ ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        'เส้นใหญ่ 100 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 2 ช้อนโต๊ะ',
                        'สันในไก่สไลด์ 40 กรัม(2ช้อนโต๊ะ)',
                        'ไข่ไก่ 1 ฟอง ',
                        'กระเทียม 1 ช้อนชา',
                        'น้ำมันพืช 1 ช้อนโต๊ะ',
                        'พริกไทยเล็กน้อย',
                        'ต้นหอมซอยเล็กน้อย'
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมัน กระเทียม และเนื้อไก่', 'ลงไปผัดให้สุกเล็กน้อย'],
                    2: ['ตามด้วยไข่ไก่ และเส้นใหญ่ผัดให้เข้ากัน'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        'เชฟแอทโฮม และ พริกไทย ผัดให้เข้ากันโรย',
                        'ด้วยต้นหอมซอย'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
                }
            },
        ]
    }, {
        typeA: 'egg',
        typeB: 'mellow',
        data: [
            {
                id: "013",
                name: ":: กะหล่ำปลีผัดไข่ ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        'กะหล่ำปลีซอย 80 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'กระเทียมสับ 1 ช้อนโต๊ะ',
                        'ไข่ไก่ 1 ฟอง',
                        'น้ำมันพืช 1 ช้อนโต๊ะ',
                        'น้ำเปล่า 4 ช้อนโต๊ะ',
                        'พริกไทยเล็กน้อย '
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมันลงไป ตามด้วยกระเทียม',
                        'ผัดจนเหลืองหอมแล้วใส่ไข่ไก่ผัดให้สุกเล็กน้อย'],
                    2: ['นำกะหล่ำปลีซอยใส่ลงไปผัดให้เข้ากัน',
                        'ระหว่างผัดใส่น้ำเปล่าลงไปด้วย'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        'เชฟแอทโฮม และ พริกไทย ผัดให้เข้ากัน'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
                }
            },
            {
                id: "015",
                name: ":: ข้าวผัดไข่หมูหยอง ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        'ข้าวสวย 120 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 ช้อนโต๊ะ ',
                        'กระเทียมสับละเอียด  1 ช้อนชา',
                        'ผักรวม 2 ช้อนโต๊ะ',
                        'ไข่ไก่ 1 ฟอง',
                        'หมูหยอง 2 ช้อนโต๊ะ',
                        'น้ำมันพืช 1 ช้อนโต๊ะ '
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางพอร้อนแล้วใส่น้ำมันลงไป ',
                        'ตามด้วยกระเทียม ผักรวม ผัดจนเหลืองหอม'],
                    2: ['ใส่ไข่ไก่ลงไปผัดจนสักระยะเติมข้าว',
                        'ผัดให้เข้ากัน'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        'เชฟแอทโฮม ผัดให้เข้ากันจนหอม'],
                    4: ['ปิดไฟตักใส่ภาชนะโรยด้วยหมูหยองด้านบน']
                }
            },
        ]
    }, {
        typeA: 'egg',
        typeB: 'flavor',
        data: [{
            id: "015",
            name: ":: ข้าวผัดไข่หมูหยอง ::",
            spicy: 0,
            selected: false,
            description1:
                [
                    'ข้าวสวย 120 กรัม',
                    'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 ช้อนโต๊ะ ',
                    'กระเทียมสับละเอียด  1 ช้อนชา',
                    'ผักรวม 2 ช้อนโต๊ะ',
                    'ไข่ไก่ 1 ฟอง',
                    'หมูหยอง 2 ช้อนโต๊ะ',
                    'น้ำมันพืช 1 ช้อนโต๊ะ '
                ],
            description2: {
                1: ['ตั้งกระทะไฟกลางพอร้อนแล้วใส่น้ำมันลงไป ',
                    'ตามด้วยกระเทียม ผักรวม ผัดจนเหลืองหอม'],
                2: ['ใส่ไข่ไก่ลงไปผัดจนสักระยะเติมข้าว',
                    'ผัดให้เข้ากัน'],
                3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                    'เชฟแอทโฮมผัด ให้เข้ากันจนหอม'],
                4: ['ปิดไฟตักใส่ภาชนะโรยด้วยหมูหยองด้านบน']
            }
        }, {
            id: "017",
            name: ":: ผักกาดดองผัดไข่ ::",
            spicy: 0,
            selected: false,
            description1:
                [
                    'โรซ่าผักกาดดองแต้จิ๋ว 1 ซอง',
                    ' (เอาแต่เนื้อ)',
                    'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 / 2 ช้อนโต๊ะ',
                    'กระเทียมสับ 1 ช้อนชา',
                    'ไข่ไก่ 1 ฟอง ',
                    'น้ำมันพืช 1 ช้อนโต๊ะ'
                ],
            description2: {
                1: ['ตั้งกระทะไฟกลางใส่น้ำมันพืชลงไป',
                    'ตามด้วยกระเทียมคั่วจนเหลืองหอม'],
                2: ['นำเนื้อผักกาดดองลงไปให้เข้ากัน'],
                3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                    'เชฟแอทโฮม ผัดให้เข้ากัน โรยด้วยพริกไทยเล็กน้อย'],
                4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
            }
        },
        ]
    }, {
        typeA: 'egg',
        typeB: 'spicy',
        data: [
            {
                id: "023",
                name: ":: ไข่คั่วกระเทียมพริกแห้ง ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        'ไข่ไก่ 3 ฟอง',
                        'พริกแห้งคั่วกับกระเทียมตำ 1 ช้อนโต๊ะ',
                        'ผักชีหั่นซอย 3 ช้อนโต๊ะ',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม  3 ช้อนโต๊ะ',
                        'น้ำมันพืช 2 ช้อนโต๊ะ',
                        'กระเทียมเจียว 1 ช้อนโต๊ะ'

                    ],
                description2: {
                    1: ['ตั้งกระทะใส่น้ำมันลงไป พอน้ำมันร้อน', 'ใส่พริกกับกระเทียมตำลงไปผัดพอเข้ากัน'],
                    2: ['ตอกไข่ลงไป คนไข่ให้กระจายตัวออก รอจนไข่เซตตัว',
                        'แล้วกลับด้านผัดต่อจนสุก'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', 'เชฟแอทโฮม ผัดคลุกเคล้าให้เข้ากัน',],
                    4: ['ใส่กระเทียมเจียวผัดคลุกเคล้าสักครู่ โรยด้วยผักชีซอยปิดเตา']
                }
            }
        ]
    }, {
        typeA: 'seafood',
        typeB: 'mellow',
        data: [
            {
                id: "012",
                name: ":: ผัดเห็ดรวมกุ้งสด ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        'เห็ดรวม 80 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1ช้อนโต๊ะ',
                        'กุ้งสด 3 ตัว ',
                        'แครอทขูด 2ช้อนโต๊ะ ',
                        'ต้นหอมท่อน 1ช้อนโต๊ะ',
                        'น้ำมันพืช 1ช้อนโต๊ะ',
                        'พริกไทยเล็กน้อย ',
                        'น้ำเปล่าเล็กน้อย'
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมันพืชลงไปตามด้วย', 'กระเทียม กุ้ง ผัดจนเหลืองหอม'],
                    2: ['ตามด้วย เห็ด แครอท ต้นหอม ใส่ลงไปผัดให้เข้ากัน', 'เติมน้ำเปล่าเล็กน้อยเวลาผัด'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                        'เชฟแอทโฮม และ พริกไทย ผัดให้เข้ากัน'],
                    4: ['ปิดไฟตักเสริฟ์ใส่ภาชนะที่เตรียมไว้']
                }
            }, {
                id: "008",
                name: ":: ผัดทะเลกระเทียม ::",
                spicy: 0,
                selected: false,
                description1:
                    [
                        'กุ้งหมึก 120 กรัม',
                        'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 ช้อนโต๊ะ',
                        'กระเทียมสับ 1 ช้อนโต๊ะ',
                        'น้ำมันพืช 1 ช้อนโต๊ะ',
                        'พริกไทยเล็กน้อย'
                    ],
                description2: {
                    1: ['ตั้งกระทะไฟกลางใส่น้ำมันพืช พอร้อนแล้ว', 'ใส่กระเทียมผัดจนเหลือง'],
                    2: ['ตามด้วยกุ้งกับหมึกที่เตรียมใส่ลงไป', 'ผัดจนสุก'],
                    3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', 'เชฟแอทโฮม พริกไทย ผัดให้เข้ากัน'],
                    4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้']
                }
            },
        ]
    }, {
        typeA: 'seafood',
        typeB: 'flavor',
        data: [{
            id: "019",
            name: ":: วุ้นเส้นผัดกุ้ง ::",
            spicy: 0,
            selected: false,
            description1:
                [
                    'วุ้นเส้น 60 กรัม',
                    'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 ช้อนโต๊ะ',
                    'กุ้งผ่าหลัง 3 ตัว ', 'กะหล่ำปลี + แครอทลวก 40 กรัม',
                    'กระเทียม 1 ช้อนชา',
                    'ไข่ไก่ 1 ฟอง',
                    'เห็ดหอม 1 ดอก (15 กรัม)',
                    'น้ำมันพืช 1 ช้อนโต๊ะ',
                    'น้ำเปล่า 3 ช้อนโต๊ะ',
                    'พริกไทยเล็กน้อย'
                ],
            description2: {
                1: ['ตั้งกระทะไฟกลางใส่น้ำมัน ตามด้วย',
                    'กระเทียม กุ้ง ไข่ไก่ ผัดให้สุกเล็กน้อย'],
                2: ['ตามด้วย เห็ดหอม กะหล่ำปลี แครอท วุ้นเส้น',
                    'ให้ผัดเข้ากันในระหว่างผัดเติมน้ำเปล่าเล็กน้อย'],
                3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                    'เชฟแอทโฮม และ พริกไทย ผัดให้เข้ากัน'],
                4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
            }
        },
        ]
    }, {
        typeA: 'seafood',
        typeB: 'spicy',
        data: [{
            id: "021",
            name: ":: ผัดกะเพราทะเล ::",
            spicy: 0,
            selected: false,
            description1:
                [
                    'กุ้งสด 150 กรัม',
                    'ปลาหมึกสด 150 กรัม',
                    'กระเทียมสับ',
                    'พริกแดง (ความเผ็ดตามชอบ)',
                    'ใบกะเพรา (เด็ดเป็นใบ)',
                    'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 3 ช้อนโต๊ะ'
                ],
            description2: {
                1: ['ใส่น้ำมันพืชลงในกระทะ รอจนกระทะร้อนจัด'],
                2: ['ใส่กุ้งและปลาหมึกลงไปผัด',
                    'ตามด้วยพริกกับกระเทียมผัดจนหอม'],
                3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                    'เชฟแอทโฮม'],
                4: ['ตามด้วยใส่ใบกะเพราลงไป',
                    'ผัดให้เข้ากันอีกรอบ ปิดไฟ ']
            }
        },
        ]
    }, {
        typeA: 'veg',
        typeB: 'mellow',
        data: [{
            id: "013",
            name: ":: กะหล่ำปลีผัดไข่ ::",
            spicy: 0,
            selected: false,
            description1:
                [
                    'กะหล่ำปลีซอย 80 กรัม',
                    'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 ช้อนโต๊ะ',
                    'กระเทียมสับ 1 ช้อนโต๊ะ',
                    'ไข่ไก่ 1 ฟอง',
                    'น้ำมันพืช 1 ช้อนโต๊ะ',
                    'น้ำเปล่า 4 ช้อนโต๊ะ',
                    'พริกไทยเล็กน้อย '
                ],
            description2: {
                1: ['ตั้งกระทะไฟกลางใส่น้ำมันลงไป ตามด้วยกระเทียม',
                    'ผัดจนเหลืองหอมแล้วใส่ไข่ไก่ผัดให้สุกเล็กน้อย'],
                2: ['นำกะหล่ำปลีซอยใส่ลงไปผัดให้เข้ากัน',
                    'ระหว่างผัดใส่น้ำเปล่าลงไปด้วย'],
                3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                    'เชฟแอทโฮม และ พริกไทย ผัดให้เข้ากัน'],
                4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
            }
        }
        ]
    }, {
        typeA: 'veg',
        typeB: 'flavor',
        data: [{
            id: "017",
            name: ":: ผักกาดดองผัดไข่ ::",
            spicy: 0,
            selected: false,
            description1:
                [
                    'โรซ่าผักกาดดองแต้จิ๋ว 1 ซอง',
                    ' (เอาแต่เนื้อ)',
                    'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 1 / 2 ช้อนโต๊ะ',
                    'กระเทียมสับ 1 ช้อนชา',
                    'ไข่ไก่ 1 ฟอง ',
                    'น้ำมันพืช 1 ช้อนโต๊ะ'
                ],
            description2: {
                1: ['ตั้งกระทะไฟกลางใส่น้ำมันพืชลงไป',
                    'ตามด้วยกระเทียมคั่วจนเหลืองหอม'],
                2: ['นำเนื้อผักกาดดองลงไปให้เข้ากัน'],
                3: ['ปรุงรสด้วย ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า',
                    'เชฟแอทโฮม ผัดให้เข้ากัน โรยด้วยพริกไทยเล็กน้อย'],
                4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
            }
        },
        ]
    }, {
        typeA: 'veg',
        typeB: 'spicy',
        data: [{
            id: "022",
            name: ":: ผัดผักบุ้งไฟแดง ::",
            spicy: 0,
            selected: false,
            description1:
                [
                    'ผักบุ้งจีน 1 กำ',
                    'กระเทียมปอกเปลือกทุบ 1 ช้อนโต๊ะ',
                    'พริกชี้ฟ้าทุบ 2 เม็ด',
                    'เต้าเจี้ยว 1 ช้อนโต๊ะ',
                    'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า', ' เชฟแอทโฮม 2 ช้อนโต๊ะ',
                    'น้ำเปล่า 2 ช้อนโต๊ะ',
                    'น้ำมันพืช 1 ช้อนโต๊ะ (สำหรับผัด)'
                ],
            description2: {
                1: ['ตัดโคนผักบุ้งออก เด็ดเป็นท่อน จากนั้น', 'ล้างน้ำให้สะอาด พักให้สะเด็ดน้ำ เตรียมไว้'],
                2: ['นำผักบุ้งใส่จาน ใส่พริก กระเทียม เต้าเจี้ยว',
                    'ซอสสารพัดผัดปรุงสำเร็จ ตราโรซ่า ', 'เชพแอทโฮม และน้ำเปล่าลงไป'],
                3: ['ตั้งกระทะใช้ไฟแรง ใส่น้ำมันพืชลงไป พอน้ำมันร้อนจัด', 'เทผักบุ้งที่เตรียมไว้ลงไป ผัดเร็ว ๆ พอให้ผักบุ้งสลด ',],
                4: ['ปิดไฟตักเสิร์ฟใส่ภาชนะที่เตรียมไว้ ']
            }
        }
        ]
    }
]

var d = dataDefault;
// var checkLocalstorage = JSON.parse(localStorage.getItem('data'));
// if (checkLocalstorage == null) {
//     localStorage.setItem('data', JSON.stringify(data));
// }
